app/controllers/medications_controller.rb

INSERT INTO "medications" ("name", "dosage", "frequency", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "teste1"], ["dosage", "10 comprimidos"], ["frequency", "1x dia"], ["user_id", 1], ["created_at", "2024-09-22 19:05:26.186139"], ["updated_at", "2024-09-22 19:05:26.186139"]]
---
  def create
    @medication = current_user.medications.build(medication_params)
    if @medication.save

UPDATE "medications" SET "frequency" = ?, "updated_at" = ? WHERE "medications"."id" = ?  [["frequency", "1x "], ["updated_at", "2024-09-22 19:05:31.730496"], ["id", 5]]
---
  def update
    if @medication.update(medication_params)

DELETE FROM "medications" WHERE "medications"."id" = ?  [["id", 4]]
---
  def destroy
    @medication.destroy

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = ? AND "medications"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def set_medication
    @medication = current_user.medications.find(params[:id])